# Window LAG

## COVID-19 Data
Notes on the data: This data was assembled based on work done by [Rodrigo Pombo](https://github.com/pomber/covid19) based on [John Hopkins University](https://systems.jhu.edu/research/public-health/ncov/), based on [World Health Organisation](https://www.who.int/health-topics/coronavirus). The data was assembled 21st April 2020 - there are no plans to keep this data set up to date.

In [1]:
# Prerequesites
from pyhive import hive
%load_ext sql
%sql hive://cloudera@quickstart.cloudera:10000/sqlzoo
%config SqlMagic.displaylimit = 20

## Window Function
The SQL Window functions include LAG, LEAD, RANK and NTILE. These functions operate over a "window" of rows - typically these are rows in the table that are in some sense adjacent.

## 1. Introducing the `covid` table

The example uses a WHERE clause to show the cases in 'Italy' in March.

```sql
SELECT name, DAY(whn),
 confirmed, deaths, recovered
 FROM covid
WHERE name = 'Italy'
AND MONTH(whn) = 3
ORDER BY whn
```

**Modify the query to show data from Spain**

In [2]:
%%sql
SELECT name, DAY(whn) day, confirmed, deaths, recovered
  FROM covid
    WHERE name='Spain' AND MONTH(whn)=3
    ORDER BY day

 * hive://cloudera@quickstart.cloudera:10000/sqlzoo
Done.

[('Spain', 1, 84, 0, 2),
 ('Spain', 2, 120, 0, 2),
 ('Spain', 3, 165, 1, 2),
 ('Spain', 4, 222, 2, 2),
 ('Spain', 5, 259, 3, 2),
 ('Spain', 6, 400, 5, 2),
 ('Spain', 7, 500, 10, 30),
 ('Spain', 8, 673, 17, 30),
 ('Spain', 9, 1073, 28, 32),
 ('Spain', 10, 1695, 35, 32),
 ('Spain', 11, 2277, 54, 183),
 ('Spain', 12, 2277, 55, 183),
 ('Spain', 13, 5232, 133, 193),
 ('Spain', 14, 6391, 195, 517),
 ('Spain', 15, 7798, 289, 517),
 ('Spain', 16, 9942, 342, 530),
 ('Spain', 17, 11748, 533, 1028),
 ('Spain', 18, 13910, 623, 1081),
 ('Spain', 19, 17963, 830, 1107),
 ('Spain', 20, 20410, 1043, 1588),
 ('Spain', 21, 25374, 1375, 2125),
 ('Spain', 22, 28768, 1772, 2575),
 ('Spain', 23, 35136, 2311, 2575),
 ('Spain', 24, 39885, 2808, 3794),
 ('Spain', 25, 49515, 3647, 5367),
 ('Spain', 26, 57786, 4365, 7015),
 ('Spain', 27, 65719, 5138, 9357),
 ('Spain', 28, 73235, 5982, 12285),
 ('Spain', 29, 80110, 6803, 14709),
 ('Spain', 30, 87956, 7716, 16780),
 ('Spain', 31, 95923, 8464, 19259)]

## 2. Introducing the LAG function

The LAG function is used to show data from the preceding row or the table. When lining up rows the data is partitioned by country name and ordered by the data whn. That means that only data from Italy is considered.

```sql
SELECT name, DAY(whn), confirmed,
   LAG(whn, 1) OVER (PARTITION BY name ORDER BY whn)
 FROM covid
WHERE name = 'Italy'
AND MONTH(whn) = 3
ORDER BY whn
```

**Modify the query to show confirmed for the day before.**

In [3]:
%%sql
SELECT name, DAY(whn) day, confirmed,
  LAG(confirmed, 1) OVER (PARTITION BY name ORDER BY whn) AS lag_confirmed
    FROM covid
    WHERE name='Italy' AND MONTH(whn)=3
    ORDER BY day

 * hive://cloudera@quickstart.cloudera:10000/sqlzoo
Done.

[('Italy', 1, 1694, None),
 ('Italy', 2, 2036, 1694),
 ('Italy', 3, 2502, 2036),
 ('Italy', 4, 3089, 2502),
 ('Italy', 5, 3858, 3089),
 ('Italy', 6, 4636, 3858),
 ('Italy', 7, 5883, 4636),
 ('Italy', 8, 7375, 5883),
 ('Italy', 9, 9172, 7375),
 ('Italy', 10, 10149, 9172),
 ('Italy', 11, 12462, 10149),
 ('Italy', 12, 12462, 12462),
 ('Italy', 13, 17660, 12462),
 ('Italy', 14, 21157, 17660),
 ('Italy', 15, 24747, 21157),
 ('Italy', 16, 27980, 24747),
 ('Italy', 17, 31506, 27980),
 ('Italy', 18, 35713, 31506),
 ('Italy', 19, 41035, 35713),
 ('Italy', 20, 47021, 41035),
 ('Italy', 21, 53578, 47021),
 ('Italy', 22, 59138, 53578),
 ('Italy', 23, 63927, 59138),
 ('Italy', 24, 69176, 63927),
 ('Italy', 25, 74386, 69176),
 ('Italy', 26, 80589, 74386),
 ('Italy', 27, 86498, 80589),
 ('Italy', 28, 92472, 86498),
 ('Italy', 29, 97689, 92472),
 ('Italy', 30, 101739, 97689),
 ('Italy', 31, 105792, 101739)]

### LAG operation

Here is the correct query showing the cases for the day before:

```sql
SELECT name, DAY(whn), confirmed,
   LAG(confirmed, 1) OVER (partition by name ORDER BY whn) AS lag
 FROM covid
WHERE name = 'Italy'
AND MONTH(whn) = 3
ORDER BY whn
```

Notice how the values in the LAG column match the value of the row diagonally above and to the left.

name | DAY(whn) | confirmed | dbf
------|---|------|----------
Italy | 1 | **1694** | null
Italy | 2 | 2036 | **1694**
Italy | 3 | 2502 | 2036
Italy | 4 | 3089 | 2502
Italy | 5 | **3858** | 3089
Italy | 6 | 4636 | **3858**
Italy | 7 | 5883 | 4636
Italy | 8 | 7375 | 5883
Italy | 9 | 9172 | 7375
Italy | 10 | 10149 | 9172
... | | |

## 3. Number of new cases

The number of confirmed case is cumulative - but we can use LAG to recover the number of new cases reported for each day.

```sql
SELECT name, DAY(whn), confirmed,
   LAG(confirmed, 1) OVER (PARTITION BY name ORDER BY whn)
 FROM covid
WHERE name = 'Italy'
AND MONTH(whn) = 3
ORDER BY whn
```

**Show the number of new cases for each day, for Italy, for March.**

In [4]:
%%sql
SELECT name, DAY(whn) day, 
  confirmed - LAG(confirmed, 1) OVER (PARTITION BY name ORDER BY whn) AS new
    FROM covid
    WHERE name = 'Italy' AND MONTH(whn) = 3
    ORDER BY day

 * hive://cloudera@quickstart.cloudera:10000/sqlzoo
Done.

[('Italy', 1, None),
 ('Italy', 2, 342),
 ('Italy', 3, 466),
 ('Italy', 4, 587),
 ('Italy', 5, 769),
 ('Italy', 6, 778),
 ('Italy', 7, 1247),
 ('Italy', 8, 1492),
 ('Italy', 9, 1797),
 ('Italy', 10, 977),
 ('Italy', 11, 2313),
 ('Italy', 12, 0),
 ('Italy', 13, 5198),
 ('Italy', 14, 3497),
 ('Italy', 15, 3590),
 ('Italy', 16, 3233),
 ('Italy', 17, 3526),
 ('Italy', 18, 4207),
 ('Italy', 19, 5322),
 ('Italy', 20, 5986),
 ('Italy', 21, 6557),
 ('Italy', 22, 5560),
 ('Italy', 23, 4789),
 ('Italy', 24, 5249),
 ('Italy', 25, 5210),
 ('Italy', 26, 6203),
 ('Italy', 27, 5909),
 ('Italy', 28, 5974),
 ('Italy', 29, 5217),
 ('Italy', 30, 4050),
 ('Italy', 31, 4053)]

## 4. Weekly changes

The data gathered are necessarily estimates and are inaccurate. However by taking a longer time span we can mitigate some of the effects.

```sql
SELECT name, DATE_FORMAT(whn,'%Y-%m-%d'), confirmed
 FROM covid
WHERE name = 'Italy'
AND WEEKDAY(whn) = 0
ORDER BY whn
```

You can filter the data to view only Monday's figures **WHERE WEEKDAY(whn) = 0**.

**Show the number of new cases in Italy for each week - show Monday only.**

In [5]:
%%sql
SELECT name, DATE_FORMAT(whn, 'yyyy-MM-dd') whn, 
  confirmed-LAG(confirmed, 1) OVER (PARTITION BY name ORDER BY whn) AS new
    FROM covid
    WHERE name = 'Italy' AND DATE_FORMAT(whn, 'u') = '1'
    ORDER BY whn

 * hive://cloudera@quickstart.cloudera:10000/sqlzoo
Done.

[('Italy', '2020-01-27', None),
 ('Italy', '2020-02-03', 2),
 ('Italy', '2020-02-10', 1),
 ('Italy', '2020-02-17', 0),
 ('Italy', '2020-02-24', 226),
 ('Italy', '2020-03-02', 1807),
 ('Italy', '2020-03-09', 7136),
 ('Italy', '2020-03-16', 18808),
 ('Italy', '2020-03-23', 35947),
 ('Italy', '2020-03-30', 37812),
 ('Italy', '2020-04-06', 30808),
 ('Italy', '2020-04-13', 26969),
 ('Italy', '2020-04-20', 21712)]

## 5. LAG using a JOIN

You can JOIN a table using DATE arithmetic. This will give different results if data is missing.

```sql
SELECT tw.name, DATE_FORMAT(tw.whn,'%Y-%m-%d'), 
 tw.confirmed, lw.confirmed
 FROM covid tw LEFT JOIN covid lw ON 
  DATE_ADD(lw.whn, INTERVAL 1 WEEK) = tw.whn
   AND tw.name=lw.name
WHERE tw.name = 'Italy'
ORDER BY tw.whn
```

**Show the number of new cases in Italy for each week - show Monday only.**

In the sample query we JOIN this week tw with last week lw using the DATE_ADD function.

In [6]:
%%sql
SELECT tw.name, DATE_FORMAT(tw.whn,'yyyy-MM-dd') whn, 
  tw.confirmed - lw.confirmed AS new
    FROM (SELECT * FROM covid WHERE name = 'Italy' AND DATE_FORMAT(whn, 'u')='1') tw
    LEFT JOIN covid lw ON 
    (DATE_ADD(lw.whn, 7) = tw.whn AND tw.name=lw.name)
    ORDER BY whn

 * hive://cloudera@quickstart.cloudera:10000/sqlzoo
Done.

[('Italy', '2020-01-27', None),
 ('Italy', '2020-02-03', 2),
 ('Italy', '2020-02-10', 1),
 ('Italy', '2020-02-17', 0),
 ('Italy', '2020-02-24', 226),
 ('Italy', '2020-03-02', 1807),
 ('Italy', '2020-03-09', 7136),
 ('Italy', '2020-03-16', 18808),
 ('Italy', '2020-03-23', 35947),
 ('Italy', '2020-03-30', 37812),
 ('Italy', '2020-04-06', 30808),
 ('Italy', '2020-04-13', 26969),
 ('Italy', '2020-04-20', 21712)]

## 6. RANK()

The query shown shows the number of confirmed cases together with the world ranking for cases.

United States has the highest number, Spain is number 2...

Notice that while Spain has the second highest confirmed cases, Italy has the second highest number of deaths due to the virus.

```sql
SELECT 
   name,
   confirmed,
   RANK() OVER (ORDER BY confirmed DESC) rc,
   deaths
  FROM covid
WHERE whn = '2020-04-20'
ORDER BY confirmed DESC
```

**Include the ranking for the number of deaths in the table. Only include countries with a population of at least 10 million.**

In [7]:
%%sql
SELECT 
  covid.name, confirmed,
    RANK() OVER (ORDER BY confirmed DESC) rc,
    deaths, RANK() OVER (ORDER BY deaths DESC) rc2
    FROM (SELECT * FROM covid WHERE whn = '2020-04-20') covid JOIN 
        (SELECT * FROM world WHERE population>=10000000) world ON
        (covid.name=world.name)
    ORDER BY confirmed DESC

 * hive://cloudera@quickstart.cloudera:10000/sqlzoo
Done.

[('United States', 784326, 1, 42094, 1),
 ('Spain', 200210, 2, 20852, 3),
 ('Italy', 181228, 3, 24114, 2),
 ('France', 156480, 4, 20292, 4),
 ('Germany', 147065, 5, 4862, 8),
 ('United Kingdom', 125856, 6, 16550, 5),
 ('Turkey', 90980, 7, 2140, 12),
 ('China', 83817, 8, 4636, 9),
 ('Iran', 83505, 9, 5209, 7),
 ('Russia', 47121, 10, 405, 23),
 ('Brazil', 40743, 11, 2587, 11),
 ('Belgium', 39983, 12, 5828, 6),
 ('Canada', 37657, 13, 1725, 13),
 ('Netherlands', 33588, 14, 3764, 10),
 ('Portugal', 20863, 15, 735, 15),
 ('India', 18539, 16, 592, 17),
 ('Peru', 16325, 17, 445, 21),
 ('Sweden', 14777, 18, 1580, 14),
 ('Japan', 10797, 19, 236, 27),
 ('South Korea', 10674, 20, 236, 27),
 ('Chile', 10507, 21, 139, 35),
 ('Saudi Arabia', 10484, 22, 103, 38),
 ('Ecuador', 10128, 23, 507, 19),
 ('Poland', 9593, 24, 380, 25),
 ('Romania', 8936, 25, 478, 20),
 ('Pakistan', 8418, 26, 176, 32),
 ('Mexico', 8261, 27, 686, 16),
 ('Czech Republic', 6900, 28, 194, 30),
 ('Indonesia', 6760, 29, 590, 18),
 ('Australia', 6547, 30, 67, 42),
 ('Philippines', 6459, 31, 428, 22),
 ('Ukraine', 5710, 32, 151, 33),
 ('Malaysia', 5425, 33, 89, 40),
 ('Dominican Republic', 4964, 34, 235, 29),
 ('Colombia', 3977, 35, 189, 31),
 ('Egypt', 3333, 36, 250, 26),
 ('South Africa', 3300, 37, 58, 43),
 ('Morocco', 3046, 38, 143, 34),
 ('Bangladesh', 2948, 39, 101, 39),
 ('Argentina', 2941, 40, 136, 36),
 ('Thailand', 2792, 41, 47, 44),
 ('Algeria', 2718, 42, 384, 24),
 ('Greece', 2245, 43, 116, 37),
 ('Kazakhstan', 1852, 44, 19, 54),
 ('Uzbekistan', 1627, 45, 5, 68),
 ('Iraq', 1574, 46, 82, 41),
 ('Azerbaijan', 1436, 47, 19, 54),
 ('Cameroon', 1163, 48, 42, 45),
 ('Cuba', 1087, 49, 36, 48),
 ('Ghana', 1042, 50, 9, 60),
 ('Afghanistan', 1026, 51, 36, 48),
 ('Tunisia', 884, 52, 38, 46),
 ("Côte d'Ivoire", 847, 53, 9, 60),
 ('Nigeria', 665, 54, 22, 52),
 ('Niger', 648, 55, 20, 53),
 ('Guinea', 622, 56, 5, 68),
 ('Burkina Faso', 581, 57, 38, 46),
 ('Bolivia', 564, 58, 33, 50),
 ('Jordan', 425, 59, 7, 64),
 ('Taiwan', 422, 60, 6, 67),
 ('Senegal', 377, 61, 5, 68),
 ('Congo, Democratic Republic of', 332, 62, 25, 51),
 ('Sri Lanka', 304, 63, 7, 64),
 ('Guatemala', 289, 64, 7, 64),
 ('Kenya', 281, 65, 14, 56),
 ('Vietnam', 268, 66, 0, 81),
 ('Venezuela', 256, 67, 9, 60),
 ('Tanzania', 254, 68, 10, 59),
 ('Mali', 246, 69, 14, 56),
 ('Somalia', 237, 70, 8, 63),
 ('Rwanda', 147, 71, 0, 81),
 ('Cambodia', 122, 72, 0, 81),
 ('Madagascar', 121, 73, 0, 81),
 ('Myanmar', 119, 74, 5, 68),
 ('Ethiopia', 111, 75, 3, 72),
 ('Sudan', 107, 76, 12, 58),
 ('Zambia', 65, 77, 3, 72),
 ('Haiti', 57, 78, 3, 72),
 ('Uganda', 56, 79, 0, 81),
 ('Benin', 54, 80, 1, 79),
 ('Mozambique', 39, 81, 0, 81),
 ('Syria', 39, 81, 3, 72),
 ('Chad', 33, 83, 0, 81),
 ('Nepal', 31, 84, 0, 81),
 ('Zimbabwe', 25, 85, 3, 72),
 ('Angola', 24, 86, 2, 77),
 ('Malawi', 17, 87, 2, 77),
 ('Burundi', 5, 88, 1, 79),
 ('South Sudan', 4, 89, 0, 81),
 ('Yemen', 1, 90, 0, 81)]

## 7. Infection rate

The query shown includes a JOIN t the world table so we can access the total population of each country and calculate infection rates (in cases per 100,000).

```sql
SELECT 
   world.name,
   ROUND(100000*confirmed/population,0)
  FROM covid JOIN world ON covid.name=world.name
WHERE whn = '2020-04-20' AND population > 10000000
ORDER BY population DESC
```

**Show the infect rate ranking for each country. Only include countries with a population of at least 10 million.**

In [8]:
%%sql
SELECT 
   world.name,
    ROUND(100000* CAST(confirmed AS DOUBLE)/population) pc_cfrm,
    RANK() OVER (ORDER BY confirmed/population) rc,
    population
    FROM covid JOIN world ON (covid.name=world.name)
        WHERE whn = '2020-04-20' AND population > 10000000
        ORDER BY population DESC

 * hive://cloudera@quickstart.cloudera:10000/sqlzoo
Done.

[('China', 6.0, 52, 1402378640.0),
 ('India', 1.0, 28, 1361503224.0),
 ('United States', 238.0, 87, 329583916.0),
 ('Indonesia', 3.0, 35, 266911900.0),
 ('Pakistan', 4.0, 42, 219412520.0),
 ('Brazil', 19.0, 65, 211442625.0),
 ('Nigeria', 0.0, 16, 206139587.0),
 ('Bangladesh', 2.0, 32, 168506944.0),
 ('Russia', 32.0, 71, 146745098.0),
 ('Mexico', 7.0, 54, 126577691.0),
 ('Japan', 9.0, 59, 125950000.0),
 ('Philippines', 6.0, 51, 108545308.0),
 ('Egypt', 3.0, 39, 100300578.0),
 ('Ethiopia', 0.0, 7, 98665000.0),
 ('Vietnam', 0.0, 15, 96208984.0),
 ('Iran', 100.0, 79, 83396540.0),
 ('Turkey', 109.0, 80, 83154997.0),
 ('Germany', 177.0, 82, 83149300.0),
 ('Congo, Democratic Republic of', 0.0, 21, 69360000.0),
 ('France', 233.0, 86, 67076000.0),
 ('Thailand', 4.0, 45, 66497905.0),
 ('United Kingdom', 189.0, 83, 66435550.0),
 ('Italy', 301.0, 88, 60238522.0),
 ('South Africa', 6.0, 50, 58775022.0),
 ('Tanzania', 0.0, 18, 55890747.0),
 ('Myanmar', 0.0, 12, 54339766.0),
 ('South Korea', 21.0, 66, 51780579.0),
 ('Colombia', 8.0, 57, 49395678.0),
 ('Kenya', 1.0, 23, 47564296.0),
 ('Spain', 425.0, 90, 47100396.0),
 ('Argentina', 7.0, 55, 44938712.0),
 ('Algeria', 6.0, 53, 43000000.0),
 ('Sudan', 0.0, 14, 42456380.0),
 ('Ukraine', 14.0, 62, 41858119.0),
 ('Uganda', 0.0, 9, 40299300.0),
 ('Iraq', 4.0, 44, 39127900.0),
 ('Poland', 25.0, 68, 38379000.0),
 ('Canada', 99.0, 78, 38007166.0),
 ('Morocco', 8.0, 58, 35879846.0),
 ('Saudi Arabia', 31.0, 70, 34218169.0),
 ('Uzbekistan', 5.0, 47, 34148357.0),
 ('Malaysia', 17.0, 64, 32761760.0),
 ('Afghanistan', 3.0, 38, 32225560.0),
 ('Venezuela', 1.0, 24, 32219521.0),
 ('Peru', 51.0, 74, 32131400.0),
 ('Angola', 0.0, 4, 31127674.0),
 ('Ghana', 3.0, 40, 30280811.0),
 ('Mozambique', 0.0, 8, 30066648.0),
 ('Nepal', 0.0, 6, 29996478.0),
 ('Yemen', 0.0, 1, 29825968.0),
 ('Cameroon', 4.0, 46, 26545864.0),
 ('Madagascar', 0.0, 20, 26251309.0),
 ('Australia', 25.0, 69, 25690023.0),
 ("Côte d'Ivoire", 4.0, 41, 23919000.0),
 ('Taiwan', 2.0, 33, 23604265.0),
 ('Niger', 3.0, 37, 22314743.0),
 ('Sri Lanka', 1.0, 29, 21803000.0),
 ('Burkina Faso', 3.0, 36, 20870060.0),
 ('Mali', 1.0, 27, 20250833.0),
 ('Romania', 46.0, 72, 19405156.0),
 ('Malawi', 0.0, 5, 19129952.0),
 ('Chile', 55.0, 75, 19107216.0),
 ('Kazakhstan', 10.0, 61, 18689256.0),
 ('Zambia', 0.0, 17, 17885422.0),
 ('Syria', 0.0, 13, 17500657.0),
 ('Ecuador', 58.0, 76, 17472948.0),
 ('Netherlands', 192.0, 84, 17459431.0),
 ('Guatemala', 2.0, 31, 16604026.0),
 ('Chad', 0.0, 11, 16244513.0),
 ('Senegal', 2.0, 34, 16209125.0),
 ('Somalia', 1.0, 30, 15893219.0),
 ('Cambodia', 1.0, 25, 15288489.0),
 ('Zimbabwe', 0.0, 10, 15159624.0),
 ('South Sudan', 0.0, 2, 12778250.0),
 ('Rwanda', 1.0, 26, 12374397.0),
 ('Guinea', 5.0, 49, 12218357.0),
 ('Benin', 0.0, 19, 11733059.0),
 ('Tunisia', 8.0, 56, 11722038.0),
 ('Haiti', 0.0, 22, 11577779.0),
 ('Belgium', 347.0, 89, 11524454.0),
 ('Bolivia', 5.0, 48, 11469896.0),
 ('Cuba', 10.0, 60, 11209628.0),
 ('Burundi', 0.0, 3, 10953317.0),
 ('Greece', 21.0, 67, 10724599.0),
 ('Czech Republic', 65.0, 77, 10693939.0),
 ('Jordan', 4.0, 43, 10666772.0),
 ('Dominican Republic', 48.0, 73, 10358320.0),
 ('Sweden', 143.0, 81, 10338368.0),
 ('Portugal', 203.0, 85, 10276617.0),
 ('Azerbaijan', 14.0, 63, 10067108.0)]

## 8. Turning the corner

For each country that has had at last 1000 new cases in a single day, show the date of the peak number of new cases.

In [9]:
%%sql
WITH t AS (
    SELECT name, whn,
       COALESCE(confirmed-LAG(confirmed, 1) OVER 
                (PARTITION BY name ORDER BY whn), 0) AS new_cases
    FROM covid
), r AS (
    SELECT name, whn, new_cases,
       RANK() OVER (PARTITION BY name ORDER BY new_cases DESC) AS rank_new
    FROM t
)
SELECT name, whn, new_cases FROM r
    WHERE rank_new=1 AND new_cases>1000
    ORDER BY whn, name

 * hive://cloudera@quickstart.cloudera:10000/sqlzoo
Done.

[('China', '2020-02-13', 15136),
 ('Italy', '2020-03-21', 6557),
 ('Switzerland', '2020-03-23', 1321),
 ('Israel', '2020-03-25', 1131),
 ('Spain', '2020-03-25', 9630),
 ('Austria', '2020-03-26', 1321),
 ('Germany', '2020-03-27', 6933),
 ('Iran', '2020-03-30', 3186),
 ('Canada', '2020-04-05', 2778),
 ('Ecuador', '2020-04-10', 2196),
 ('Ireland', '2020-04-10', 1515),
 ('Netherlands', '2020-04-10', 1346),
 ('Portugal', '2020-04-10', 1516),
 ('United Kingdom', '2020-04-10', 8733),
 ('United States', '2020-04-10', 33755),
 ('Turkey', '2020-04-11', 5138),
 ('France', '2020-04-12', 26849),
 ('Peru', '2020-04-13', 2265),
 ('Belgium', '2020-04-15', 2454),
 ('Brazil', '2020-04-17', 3257),
 ('Japan', '2020-04-17', 1161),
 ('Saudi Arabia', '2020-04-18', 1132),
 ('India', '2020-04-19', 1893),
 ('Russia', '2020-04-19', 6060),
 ('Belarus', '2020-04-20', 1485),
 ('Singapore', '2020-04-20', 1426)]